#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
module.tf_repository["github"].github_repository.repository: Refreshing state... [id=tf-github]
module.tf_repository["github"].data.github_team.owner: Reading...
module.svc_repository["storage"].data.github_team.owner: Reading...
module.tf_repository["onboarding"].github_repository.repository: Refreshing state... [id=tf-onboarding]
github_repository.svc_template_typescript: Refreshing state... [id=svc-template-typescript]
github_repository.svc_template_python: Refreshing state... [id=svc-template-python]
module.tf_repository["onboarding"].data.github_team.owner: Reading...
github_repository.svc_template_rust: Refreshing state... [id=svc-template-rust]
github_repository_file.svc_template_python_sdd: Refreshing state... [id=svc-template-python/docs/sdd.md]
github_team_repository.svc_template_python_maintainer: Refreshing state... [id=6311795:svc-template-python]
github_repository_file.svc_template_typescript_sdd: Refreshing state... [id=svc-template-typescript/docs/sdd.md]
github_team_repository.svc_template_typescript_maintainer: Refreshing state... [id=6311795:svc-template-typescript]
module.tf_repository["github"].github_branch_default.default: Refreshing state... [id=tf-github]
module.tf_repository["onboarding"].github_branch_default.default: Refreshing state... [id=tf-onboarding]
module.tf_repository["onboarding"].data.github_team.owner: Read complete after 4s [id=6029505]
module.svc_repository["storage"].data.github_team.owner: Read complete after 5s [id=6311795]
module.tf_repository["github"].data.github_team.owner: Read complete after 6s [id=6311795]
module.tf_repository["onboarding"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-onboarding]
module.tf_repository["github"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-github/.github/CODEOWNERS]
module.tf_repository["github"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-github]
module.tf_repository["onboarding"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-onboarding/.github/CODEOWNERS]
module.tf_repository["github"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-github]
github_team_repository.svc_template_rust_maintainer: Refreshing state... [id=6311795:svc-template-rust]
github_repository_file.svc_template_rust_sdd: Refreshing state... [id=svc-template-rust/docs/sdd.md]
module.svc_repository["storage"].github_repository.repository: Refreshing state... [id=svc-storage]
module.repository["svc-scheduler"].data.github_team.owner: Reading...
module.repository["tools"].data.github_team.owner: Reading...
module.repository["website"].data.github_team.owner: Reading...
module.repository["cla-bot"].data.github_team.owner: Reading...
module.repository["clabot-config"].data.github_team.owner: Reading...
module.repository["website"].github_repository.repository: Refreshing state... [id=website]
module.repository["cla-bot"].github_repository.repository: Refreshing state... [id=cla-bot]
module.repository["clabot-config"].github_repository.repository: Refreshing state... [id=clabot-config]
module.repository["tools"].github_repository.repository: Refreshing state... [id=tools]
module.svc_repository["storage"].github_branch.branch["develop"]: Refreshing state... [id=svc-storage:develop]
module.svc_repository["storage"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-storage]
module.tf_repository["github"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOG6VIns4BpLGe]
module.repository["website"].github_branch.branch["staging"]: Refreshing state... [id=website:staging]
module.repository["svc-scheduler"].data.github_team.owner: Read complete after 8s [id=6311795]
module.repository["tools"].data.github_team.owner: Read complete after 8s [id=6203057]
module.repository["website"].data.github_team.owner: Read complete after 8s [id=5490296]
module.svc_repository["storage"].github_branch_default.default: Refreshing state... [id=svc-storage]
module.repository["cla-bot"].data.github_team.owner: Read complete after 9s [id=6029505]
module.repository["clabot-config"].data.github_team.owner: Read complete after 9s [id=6029505]
module.repository["website"].github_team_repository.maintainer["webdevelopers"]: Refreshing state... [id=5490296:website]
module.repository["cla-bot"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:cla-bot]
module.repository["tools"].github_team_repository.maintainer["drone-engineering"]: Refreshing state... [id=6203057:tools]
module.repository["clabot-config"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:clabot-config]
module.repository["cla-bot"].github_branch_default.default: Refreshing state... [id=cla-bot]
module.repository["clabot-config"].github_branch_default.default: Refreshing state... [id=clabot-config]
module.repository["tools"].github_branch_default.default: Refreshing state... [id=tools]
module.repository["website"].github_branch_default.default: Refreshing state... [id=website]
module.svc_repository["storage"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-storage/.github/CODEOWNERS]
module.repository["cla-bot"].github_repository_file.CODEOWNERS: Refreshing state... [id=cla-bot/.github/CODEOWNERS]
module.repository["website"].github_repository_file.CODEOWNERS: Refreshing state... [id=website/.github/CODEOWNERS]
module.repository["tools"].github_repository_file.CODEOWNERS: Refreshing state... [id=tools/.github/CODEOWNERS]
module.repository["clabot-config"].github_repository_file.CODEOWNERS: Refreshing state... [id=clabot-config/.github/CODEOWNERS]
module.svc_repository["storage"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Ji84BmmRg]
module.svc_repository["storage"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHn-Ji84BpLXK]
module.repository["website"].github_branch_protection.protection["staging"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcL]
module.repository["website"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcN]
module.repository["cla-bot"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHTAbhc4BmmRb]
module.repository["tools"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Jf84BmmRe]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["clabot-config"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "clabot-config"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository["svc-scheduler"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "svc-scheduler"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository["svc-scheduler"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "svc-scheduler"
    }

  # module.repository["svc-scheduler"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "svc-scheduler"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository["svc-scheduler"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "svc-scheduler"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository["svc-scheduler"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Arrow Services Scheduler module"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "svc-scheduler"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true

      + template {
          + owner      = "Arrow-air"
          + repository = "0"
        }
    }

  # module.repository["svc-scheduler"].github_repository_file.CODEOWNERS will be created
  + resource "github_repository_file" "CODEOWNERS" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository["svc-scheduler"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "svc-scheduler"
      + team_id    = "services"
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ dismiss_stale_reviews           = false -> true
          ~ require_code_owner_reviews      = false -> true
          ~ restrict_dismissals             = false -> true
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.tf_repository["onboarding"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "tf-onboarding"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_status_checks {
          + strict = true
        }
    }

Plan: 9 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ repositories = {
      + svc-scheduler = {
          + protected_branches = {
              + develop = {
                  + allows_deletions                = false
                  + enforce_admins                  = true
                  + push_restrictions               = []
                  + require_conversation_resolution = true
                  + require_signed_commits          = true
                  + required_pull_request_reviews   = {
                      + dismiss_stale_reviews           = true
                      + dismissal_restrictions          = []
                      + pull_request_bypassers          = []
                      + require_code_owner_reviews      = true
                      + required_approving_review_count = 1
                      + restrict_dismissals             = true
                    }
                  + required_status_checks          = {
                      + strict = true
                    }
                }
              + main    = {
                  + allows_deletions                = false
                  + enforce_admins                  = true
                  + pattern                         = null
                  + push_restrictions               = []
                  + require_conversation_resolution = true
                  + require_signed_commits          = true
                  + required_pull_request_reviews   = {
                      + dismiss_stale_reviews           = true
                      + dismissal_restrictions          = []
                      + pull_request_bypassers          = []
                      + require_code_owner_reviews      = true
                      + required_approving_review_count = 1
                      + restrict_dismissals             = true
                    }
                  + required_status_checks          = {
                      + strict = true
                    }
                }
            }
        }
        # (4 unchanged elements hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @ServiceDog, Action: `pull_request`*